{"222_requirements": "i like trains, please provide trains", "123abc_requirements": "hello world is not allowed", "world_hello_requirements": "do not use hello world", "e_requirements": "e", "1_requirements": "eeee", "eee_requirements": "eeee", "eeeee_requirements": "eeee", "eeee_requirements": "eeeee", "giohjwaroigqwrgqweghw43trh_requirements": "no hello world, if they do hello world they are brain dead", "eeeeeeeeeeeeeee_requirements": "world_hello", "fortnite_requirements": "fortnite", "s_requirements": "s", "a_requirements": "literally jus tsay fortnnite, if you say anything but fortnite, its an F", "fawegwerg_requirements": "\n\nYou've got what rebase does backwards. git rebase master does what you're asking for — takes the changes on the current branch (since its divergence from master) and replays them on top of master, then sets the head of the current branch to be the head of that new history. It doesn't replay the changes from master on top of the current branch.\n", "yeah_requirements": "fortnnite yeah buddy", "yes_requirements": "yes", "sefhgdertbderthn_requirements": "\n\n### **Rubric**\n\n| **Category**          | **Excellent (4)**                                          | **Good (3)**                                           | **Fair (2)**                                           | **Poor (1)**                                            |\n|-----------------------|------------------------------------------------------------|--------------------------------------------------------|--------------------------------------------------------|---------------------------------------------------------|\n| **Character Accuracy** | Depicts Hello Kitty with accurate features (red bow, no mouth, simple design). | Minor inaccuracies but still recognizable as Hello Kitty. | Several inaccuracies that make her less recognizable. | Not recognizable as Hello Kitty at all.                |\n| **Theme Relevance**   | Perfectly captures Hello Kitty’s themes (friendship, kindness, simplicity). | Mostly sticks to themes, with minor inconsistencies.   | Themes are loosely connected; message isn’t clear.    | No relevance to Hello Kitty’s themes.                  |\n| **Creativity**        | Highly original, creative use of Hello Kitty’s style or story. | Shows creativity, some unique elements.               | Limited creativity; relies on common ideas.            | Lacks creativity; feels copied or uninspired.          |\n| **Presentation Quality** | Clean, well-organized, and easy to understand.            | Mostly clear, minor issues with organization.          | Somewhat confusing, disorganized in places.            | Hard to follow or poorly presented.                    |\n| **Effort and Detail** | Shows exceptional effort; lots of thoughtful detail.        | Good effort; details are mostly considered.            | Minimal effort; lacks attention to detail.             | Rushed or incomplete; missing key details.             |\n\n", "awegq234gqw4g_requirements": "The world isn't flat because all observable evidence points to it being an oblate spheroid—a sphere slightly flattened at the poles and bulging at the equator. Here’s why:\n\n    Photos from Space: Satellites and astronauts have taken countless images of Earth from space, showing a round planet. These aren't faked—satellites depend on accurate physics to stay in orbit, which only works with a spherical Earth.\n\n    Gravity: Gravity pulls everything toward the center of mass. On a flat Earth, gravity would pull at weird angles the farther you got from the center, causing water to slope and buildings to lean. That’s not what happens.\n\n    Time Zones: The planet has time zones because it rotates. On a flat Earth, explaining why it’s noon in one place and midnight in another at the same time doesn’t make sense.\n\n    Airplane Flights: Planes follow curved routes (great circles) because that’s the shortest distance on a sphere. If the Earth were flat, flight paths would look different—many long-haul flights in the Southern Hemisphere make zero sense on flat Earth maps.\n\n    Ships Disappearing Over the Horizon: Ships don’t just get smaller as they sail away; they disappear bottom first. This only makes sense if the surface they’re sailing on curves downward.\n\n    The Earth's Shadow on the Moon: During lunar eclipses, Earth casts a round shadow on the moon. It’s always round, no matter the angle. Only a sphere always casts a circular shadow.\n\n    Coriolis Effect: Weather patterns and ocean currents behave differently in the Northern and Southern Hemispheres because Earth is spinning. This wouldn’t happen on a flat, stationary plane.\n\nPeople figured this out over 2,000 years ago. Eratosthenes measured shadows in two cities and calculated Earth's circumference with surprising accuracy.\n\nFlat Earth arguments ignore basic physics, geometry, and empirical evidence."}